tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services", "https://mirrors.ustc.edu.cn/homebrew-services.git"
brew "ansible"
brew "ansible@10"
brew "ctags"
brew "docker-gen"
brew "fzf"
brew "git"
brew "subversion"
brew "git-svn"
brew "go"
brew "helm"
brew "jenv"
brew "kubernetes-cli"
brew "krew"
brew "kube-ps1"
brew "kubecm"
brew "kustomize"
brew "neovim"
brew "nvm"
brew "openjdk@8"
brew "opentofu"
brew "pipx"
brew "rclone"
brew "telnet"
brew "tig"
brew "tmux"
brew "wget"
brew "yq"
brew "zsh"
brew "hashicorp/tap/terraform"
cask "iterm2"
cask "jd-gui"
cask "microsoft-remote-desktop"
cask "openvpn-connect"
cask "temurin@8"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "ahmadalli.vscode-nginx-conf"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "bradlc.vscode-tailwindcss"
vscode "continue.continue"
vscode "dariofuzinato.vue-peek"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabianlauer.vs-code-xml-format"
vscode "formulahendry.auto-close-tag"
vscode "foxundermoon.shell-format"
vscode "genieai.chatgpt-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "gitpod.gitpod-flex"
vscode "gitpod.gitpod-remote-ssh"
vscode "gitpod.gitpod-theme"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "johnpapa.vscode-cloak"
vscode "maarti.jenkins-doc"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "pranaygp.vscode-css-peek"
vscode "rangav.vscode-thunder-client"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "saoudrizwan.claude-dev"
vscode "sdras.vue-vscode-snippets"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "xabikos.javascriptsnippets"
