tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Reimplementation of ctags(1)
brew "ctags"
# Create Docker hosts locally and on cloud providers
brew "docker-machine", link: false
# Program that can automate interactive applications
brew "expect"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# SDK for Groovy: a Java-based scripting language
brew "groovysdk"
# Interactive computing in Python
brew "ipython"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# The Kubernetes package manager
brew "kubernetes-helm"
# Java-based project management
brew "maven@3.5"
# ls, cp, mkdir, diff and rsync for filesystems and object storage
brew "minio-mc"
# Platform built on V8 to build network applications
brew "node"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Advanced filtering web proxy
brew "privoxy"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "java8"
cask "neteasemusic"
cask "shadowsocksx-ng"
cask "sogouinput"
cask "teamviewer"
cask "vagrant"
cask "virtualbox"
cask "wechat"
